export interface DetailedSubject {
  name: string;
  summerHours: number;
  winterHours: number;
}

export interface DetailedProgram {
  grade: string;
  track: string;
  subjects: DetailedSubject[];
  totalSummerHours: number;
  totalWinterHours: number;
  info: string[];
}

export const detailedPrograms: DetailedProgram[] = [
  {
    grade: "Α΄ ΓΥΜΝΑΣΙΟΥ 2025-2026",
    track: "",
    subjects: [
      {
        name: "ΜΑΘΗΜΑΤΙΚΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΝΕΟΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ",
        summerHours: 0,
        winterHours: 1,
      },
      {
        name: "ΑΡΧΑΙΑ ΕΛΛΗΝΙΚΗ ΓΡΑΜΜΑΤΕΙΑ",
        summerHours: 0,
        winterHours: 1,
      },
    ],
    totalSummerHours: 0,
    totalWinterHours: 4,
    info: [
      "ΕΝΑΡΞΗ ΜΑΘΗΜΑΤΩΝ: 8 Σεπτεμβρίου 2025",
      "ΚΥΚΛΟΙ ΔΙΑΓΩΝΙΣΜΑΤΩΝ: 1ος - 19/10 μέχρι 23/11, 2ος - 25/01 μέχρι 01/03, 3ος ΠΡΟΣΟΜΟΙΩΣΗΣ (ο κύκλος αυτός εξαρτάται από τις ημερομηνίες διεξαγωγής των πανελληνίων εξετάσεων )",
      "ΕΝΗΜΕΡΩΣΕΙΣ ΓΟΝΕΩΝ: 1η ενημέρωση(τηλεφωνική): 1ο δεκαήμερο Οκτωβρίου, 2η ενημέρωση γονέων : 29-30/11, 3η ενημέρωση γονέων: 7-8/3, 4η ενημέρωση γονέων : εξαρτάται από τη διεξαγωγή των διαγωνισμάτων προσομοίωσης",
    ],
  },
  {
    grade: "Β΄ ΓΥΜΝΑΣΙΟΥ 2025 - 2026",
    track: "",
    subjects: [
      {
        name: "ΜΑΘΗΜΑΤΙΚΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΝΕΟΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ",
        summerHours: 0,
        winterHours: 1,
      },
      {
        name: "ΑΡΧΑΙΑ ΕΛΛΗΝΙΚΗ ΓΡΑΜΜΑΤΕΙΑ",
        summerHours: 0,
        winterHours: 1,
      },
      {
        name: "ΦΥΣΙΚΗ",
        summerHours: 0,
        winterHours: 1,
      },
      {
        name: "ΧΗΜΕΙΑ",
        summerHours: 0,
        winterHours: 1,
      },
    ],
    totalSummerHours: 0,
    totalWinterHours: 6,
    info: [
      "ΕΝΑΡΞΗ ΜΑΘΗΜΑΤΩΝ: 8 Σεπτεμβρίου 2025",
      "ΚΥΚΛΟΙ ΔΙΑΓΩΝΙΣΜΑΤΩΝ: 1ος - 19/10 μέχρι 23/11, 2ος - 25/01 μέχρι 01/03, 3ος ΠΡΟΣΟΜΟΙΩΣΗΣ (ο κύκλος αυτός εξαρτάται από τις ημερομηνίες διεξαγωγής των πανελληνίων εξετάσεων )",
      "ΕΝΗΜΕΡΩΣΕΙΣ ΓΟΝΕΩΝ: 1η ενημέρωση(τηλεφωνική): 1ο δεκαήμερο Οκτωβρίου, 2η ενημέρωση γονέων : 29-30/11, 3η ενημέρωση γονέων: 7-8/3, 4η ενημέρωση γονέων : εξαρτάται από τη διεξαγωγή των διαγωνισμάτων προσομοίωσης",
    ],
  },
  {
    grade: "Γ΄ ΓΥΜΝΑΣΙΟΥ 2025- 2026",
    track: "",
    subjects: [
      {
        name: "ΜΑΘΗΜΑΤΙΚΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΝΕΟΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ",
        summerHours: 0,
        winterHours: 1,
      },
      {
        name: "ΑΡΧΑΙΑ ΕΛΛΗΝΙΚΗ ΓΡΑΜΜΑΤΕΙΑ",
        summerHours: 0,
        winterHours: 1,
      },
      {
        name: "ΧΗΜΕΙΑ",
        summerHours: 0,
        winterHours: 1,
      },
      {
        name: "ΦΥΣΙΚΗ",
        summerHours: 0,
        winterHours: 1,
      },
    ],
    totalSummerHours: 0,
    totalWinterHours: 6,
    info: [
      "ΕΝΑΡΞΗ ΜΑΘΗΜΑΤΩΝ: 8 Σεπτεμβρίου 2025",
      "ΚΥΚΛΟΙ ΔΙΑΓΩΝΙΣΜΑΤΩΝ: 1ος - 19/10 μέχρι 23/11, 2ος - 25/01 μέχρι 01/03, 3ος ΠΡΟΣΟΜΟΙΩΣΗΣ (ο κύκλος αυτός εξαρτάται από τις ημερομηνίες διεξαγωγής των πανελληνίων εξετάσεων )",
      "ΕΝΗΜΕΡΩΣΕΙΣ ΓΟΝΕΩΝ: 1η ενημέρωση(τηλεφωνική): 1ο δεκαήμερο Οκτωβρίου, 2η ενημέρωση γονέων : 29-30/11, 3η ενημέρωση γονέων: 7-8/3, 4η ενημέρωση γονέων : εξαρτάται από τη διεξαγωγή των διαγωνισμάτων προσομοίωσης",
    ],
  },
  {
    grade: "Α΄ ΛΥΚΕΙΟΥ 2025 - 2026",
    track: "",
    subjects: [
      {
        name: "ΑΛΓΕΒΡΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΝΕΟΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ & ΛΟΓΟΤΕΧΝΙΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΓΕΩΜΕΤΡΙΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΦΥΣΙΚΗ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΧΗΜΕΙΑ",
        summerHours: 0,
        winterHours: 1,
      },
      {
        name: "ΑΡΧΑΙΑ",
        summerHours: 0,
        winterHours: 2,
      },
    ],
    totalSummerHours: 0,
    totalWinterHours: 11,
    info: [
      "ΕΝΑΡΞΗ ΜΑΘΗΜΑΤΩΝ: 4 Σεπτεμβρίου 2025",
      "ΚΥΚΛΟΙ ΔΙΑΓΩΝΙΣΜΑΤΩΝ: 1ος - 19/10 μέχρι 23/11, 2ος - 25/01 μέχρι 01/03, 3ος ΠΡΟΣΟΜΟΙΩΣΗΣ (ο κύκλος αυτός εξαρτάται από τις ημερομηνίες διεξαγωγής των πανελληνίων εξετάσεων )",
      "ΕΝΗΜΕΡΩΣΕΙΣ ΓΟΝΕΩΝ: 1η ενημέρωση(τηλεφωνική): 1ο δεκαήμερο Οκτωβρίου, 2η ενημέρωση γονέων : 29-30/11, 3η ενημέρωση γονέων: 7-8/3, 4η ενημέρωση γονέων : εξαρτάται από τη διεξαγωγή των διαγωνισμάτων προσομοίωσης",
    ],
  },
  {
    grade: "Β΄ ΛΥΚΕΙΟΥ 2025 - 2026",
    track: "Θετικών Σπουδών /Σπουδών Υγείας",
    subjects: [
      {
        name: "ΦΥΣΙΚΗ Β ΛΥΚΕΙΟΥ",
        summerHours: 0,
        winterHours: 1,
      },
      {
        name: "ΦΥΣΙΚΗ ΠΡΟΣΑΝΑΤΟΛΙΣΜΟΥ Β' & Γ ΛΥΚΕΙΟΥ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΝΕΟΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ & ΛΟΓΟΤΕΧΝΙΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΧΗΜΕΙΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΑΛΓΕΒΡΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΜΑΘΗΜΑΤΙΚΑ ΚΑΤΕΥΘΥΝΣΗΣ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΒΙΟΛΟΓΙΑ",
        summerHours: 0,
        winterHours: 1,
      },
    ],
    totalSummerHours: 0,
    totalWinterHours: 12,
    info: [
      "ΕΝΑΡΞΗ ΜΑΘΗΜΑΤΩΝ: 4 Σεπτεμβρίου 2025",
      "ΚΥΚΛΟΙ ΔΙΑΓΩΝΙΣΜΑΤΩΝ: 1ος - 19/10 μέχρι 23/11, 2ος - 25/01 μέχρι 01/03, 3ος ΠΡΟΣΟΜΟΙΩΣΗΣ (ο κύκλος αυτός εξαρτάται από τις ημερομηνίες διεξαγωγής των πανελληνίων εξετάσεων )",
      "ΕΝΗΜΕΡΩΣΕΙΣ ΓΟΝΕΩΝ: 1η ενημέρωση(τηλεφωνική): 1ο δεκαήμερο Οκτωβρίου, 2η ενημέρωση γονέων : 29-30/11, 3η ενημέρωση γονέων: 7-8/3, 4η ενημέρωση γονέων : εξαρτάται από τη διεξαγωγή των διαγωνισμάτων προσομοίωσης",
    ],
  },
  {
    grade: "Β΄ ΛΥΚΕΙΟΥ 2025 - 2026",
    track: "ΑΝΘΡΩΠΙΣΤΙΚΩΝ ΣΠΟΥΔΩΝ",
    subjects: [
      {
        name: "ΑΡΧΑΙΑ ΑΓΝΩΣΤΟ",
        summerHours: 0,
        winterHours: 3,
      },
      {
        name: "ΑΡΧΑΙΑ ΓΝΩΣΤΟ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΛΑΤΙΝΙΚΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΝΕΟΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ & ΛΟΓΟΤΕΧΝΙΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΙΣΤΟΡΙΑ",
        summerHours: 0,
        winterHours: 1,
      },
    ],
    totalSummerHours: 0,
    totalWinterHours: 10,
    info: [
      "ΕΝΑΡΞΗ ΜΑΘΗΜΑΤΩΝ: 4 Σεπτεμβρίου 2025",
      "ΚΥΚΛΟΙ ΔΙΑΓΩΝΙΣΜΑΤΩΝ: 1ος - 19/10 μέχρι 23/11, 2ος - 25/01 μέχρι 01/03, 3ος ΠΡΟΣΟΜΟΙΩΣΗΣ (ο κύκλος αυτός εξαρτάται από τις ημερομηνίες διεξαγωγής των πανελληνίων εξετάσεων )",
      "ΕΝΗΜΕΡΩΣΕΙΣ ΓΟΝΕΩΝ: 1η ενημέρωση(τηλεφωνική): 1ο δεκαήμερο Οκτωβρίου, 2η ενημέρωση γονέων : 29-30/11, 3η ενημέρωση γονέων: 7-8/3, 4η ενημέρωση γονέων : εξαρτάται από τη διεξαγωγή των διαγωνισμάτων προσομοίωσης",
    ],
  },
  {
    grade: "Β΄ ΛΥΚΕΙΟΥ 2025 - 2026",
    track: "Οικονομικές Σπουδές",
    subjects: [
      {
        name: "ΜΑΘΗΜΑΤΙΚΑ ΚΑΤΕΥΘΥΝΣΗΣ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΑΛΓΕΒΡΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΝΕΟΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ & ΛΟΓΟΤΕΧΝΙΑ",
        summerHours: 0,
        winterHours: 2,
      },
      {
        name: "ΠΛΗΡΟΦΟΡΙΚΗ (ΑΕΠΠ)",
        summerHours: 0,
        winterHours: 1,
      },
      {
        name: "ΟΙΚΟΝΟΜΙΑ (ΑΟΘ)",
        summerHours: 0,
        winterHours: 1,
      },
      {
        name: "ΦΥΣΙΚΗ-ΧΗΜΕΙΑ",
        summerHours: 0,
        winterHours: 2,
      },
    ],
    totalSummerHours: 0,
    totalWinterHours: 10,
    info: [
      "ΕΝΑΡΞΗ ΜΑΘΗΜΑΤΩΝ: 4 Σεπτεμβρίου 2025",
      "ΚΥΚΛΟΙ ΔΙΑΓΩΝΙΣΜΑΤΩΝ: 1ος - 19/10 μέχρι 23/11, 2ος - 25/01 μέχρι 01/03, 3ος ΠΡΟΣΟΜΟΙΩΣΗΣ (ο κύκλος αυτός εξαρτάται από τις ημερομηνίες διεξαγωγής των πανελληνίων εξετάσεων )",
      "ΕΝΗΜΕΡΩΣΕΙΣ ΓΟΝΕΩΝ: 1η ενημέρωση(τηλεφωνική): 1ο δεκαήμερο Οκτωβρίου, 2η ενημέρωση γονέων : 29-30/11, 3η ενημέρωση γονέων: 7-8/3, 4η ενημέρωση γονέων : εξαρτάται από τη διεξαγωγή των διαγωνισμάτων προσομοίωσης",
    ],
  },
  {
    grade: "Γ΄ ΛΥΚΕΙΟΥ 2025-2026",
    track: "1ο ΠΕΔΙΟ: Ανθρωπιστικών Σπουδών",
    subjects: [
      {
        name: "ΝΕΟΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ & ΓΡΑΜΜΑΤΕΙΑ",
        summerHours: 3,
        winterHours: 2,
      },
      {
        name: "ΑΡΧΑΙΑ ΔΙΔΑΓΜΕΝΟ",
        summerHours: 2,
        winterHours: 2,
      },
      {
        name: "ΑΡΧΑΙΑ ΑΔΙΔΑΚΤΟ",
        summerHours: 4,
        winterHours: 3,
      },
      {
        name: "ΙΣΤΟΡΙΑ",
        summerHours: 3,
        winterHours: 3,
      },
      {
        name: "ΛΑΤΙΝΙΚΑ",
        summerHours: 4,
        winterHours: 3,
      },
    ],
    totalSummerHours: 16,
    totalWinterHours: 13,
    info: [
      "ΕΝΑΡΞΗ ΜΑΘΗΜΑΤΩΝ: 1 Σεπτεμβρίου 2025",
      "ΚΥΚΛΟΙ ΔΙΑΓΩΝΙΣΜΑΤΩΝ: 1ος - 19/10 μέχρι 23/11, 2ος - 25/01 μέχρι 01/03, 3ος ΠΡΟΣΟΜΟΙΩΣΗΣ (ο κύκλος αυτός εξαρτάται από τις ημερομηνίες διεξαγωγής των πανελληνίων εξετάσεων )",
      "ΕΝΗΜΕΡΩΣΕΙΣ ΓΟΝΕΩΝ: 1η ενημέρωση(τηλεφωνική): 1ο δεκαήμερο Οκτωβρίου, 2η ενημέρωση γονέων : 29-30/11, 3η ενημέρωση γονέων: 7-8/3, 4η ενημέρωση γονέων : εξαρτάται από τη διεξαγωγή των διαγωνισμάτων προσομοίωσης",
    ],
  },
  {
    grade: "Γ΄ ΛΥΚΕΙΟΥ 2025-2026",
    track: "2ο ΠΕΔΙΟ: Θετικών Σπουδών",
    subjects: [
      {
        name: "ΝΕΟΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ & ΓΡΑΜΜΑΤΕΙΑ",
        summerHours: 3,
        winterHours: 2,
      },
      {
        name: "ΦΥΣΙΚΗ",
        summerHours: 5,
        winterHours: 4,
      },
      {
        name: "ΧΗΜΕΙΑ",
        summerHours: 4,
        winterHours: 4,
      },
      {
        name: "ΜΑΘΗΜΑΤΙΚΑ",
        summerHours: 6,
        winterHours: 5,
      },
    ],
    totalSummerHours: 18,
    totalWinterHours: 15,
    info: [
      "ΕΝΑΡΞΗ ΜΑΘΗΜΑΤΩΝ: 1 Σεπτεμβρίου 2025",
      "ΚΥΚΛΟΙ ΔΙΑΓΩΝΙΣΜΑΤΩΝ: 1ος - 19/10 μέχρι 23/11, 2ος - 25/01 μέχρι 01/03, 3ος ΠΡΟΣΟΜΟΙΩΣΗΣ (ο κύκλος αυτός εξαρτάται από τις ημερομηνίες διεξαγωγής των πανελληνίων εξετάσεων )",
      "ΕΝΗΜΕΡΩΣΕΙΣ ΓΟΝΕΩΝ: 1η ενημέρωση(τηλεφωνική): 1ο δεκαήμερο Οκτωβρίου, 2η ενημέρωση γονέων : 29-30/11, 3η ενημέρωση γονέων: 7-8/3, 4η ενημέρωση γονέων : εξαρτάται από τη διεξαγωγή των διαγωνισμάτων προσομοίωσης",
    ],
  },
  {
    grade: "Γ΄ ΛΥΚΕΙΟΥ 2025-2026",
    track: "4ο ΠΕΔΙΟ: Σπουδές Οικονομίας & Πληροφορικής",
    subjects: [
      {
        name: "ΝΕΟΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ & ΓΡΑΜΜΑΤΕΙΑ",
        summerHours: 3,
        winterHours: 2,
      },
      {
        name: "ΜΑΘΗΜΑΤΙΚΑ",
        summerHours: 6,
        winterHours: 5,
      },
      {
        name: "ΠΛΗΡΟΦΟΡΙΚΗ (Α.Ε.Π.Π.)",
        summerHours: 4,
        winterHours: 3,
      },
      {
        name: "ΟΙΚΟΝΟΜΙΑ (Α.Ο.Θ)",
        summerHours: 3,
        winterHours: 3,
      },
    ],
    totalSummerHours: 16,
    totalWinterHours: 13,
    info: [
      "ΕΝΑΡΞΗ ΜΑΘΗΜΑΤΩΝ: 1 Σεπτεμβρίου 2025",
      "ΚΥΚΛΟΙ ΔΙΑΓΩΝΙΣΜΑΤΩΝ: 1ος - 19/10 μέχρι 23/11, 2ος - 25/01 μέχρι 01/03, 3ος ΠΡΟΣΟΜΟΙΩΣΗΣ (ο κύκλος αυτός εξαρτάται από τις ημερομηνίες διεξαγωγής των πανελληνίων εξετάσεων )",
      "ΕΝΗΜΕΡΩΣΕΙΣ ΓΟΝΕΩΝ: 1η ενημέρωση(τηλεφωνική): 1ο δεκαήμερο Οκτωβρίου, 2η ενημέρωση γονέων : 29-30/11, 3η ενημέρωση γονέων: 7-8/3, 4η ενημέρωση γονέων : εξαρτάται από τη διεξαγωγή των διαγωνισμάτων προσομοίωσης",
    ],
  },
  {
    grade: "Γ΄ ΛΥΚΕΙΟΥ 2025-2026",
    track: "3ο ΠΕΔΙΟ: Σπουδών Υγείας",
    subjects: [
      {
        name: "ΝΕΟΕΛΛΗΝΙΚΗ ΓΛΩΣΣΑ & ΓΡΑΜΜΑΤΕΙΑ",
        summerHours: 3,
        winterHours: 2,
      },
      {
        name: "ΦΥΣΙΚΗ",
        summerHours: 5,
        winterHours: 4,
      },
      {
        name: "ΧΗΜΕΙΑ",
        summerHours: 4,
        winterHours: 4,
      },
      {
        name: "ΒΙΟΛΟΓΙΑ",
        summerHours: 4,
        winterHours: 3,
      },
    ],
    totalSummerHours: 16,
    totalWinterHours: 13,
    info: [
      "ΕΝΑΡΞΗ ΜΑΘΗΜΑΤΩΝ: 1 Σεπτεμβρίου 2025",
      "ΚΥΚΛΟΙ ΔΙΑΓΩΝΙΣΜΑΤΩΝ: 1ος - 19/10 μέχρι 23/11, 2ος - 25/01 μέχρι 01/03, 3ος ΠΡΟΣΟΜΟΙΩΣΗΣ (ο κύκλος αυτός εξαρτάται από τις ημερομηνίες διεξαγωγής των πανελληνίων εξετάσεων )",
      "ΕΝΗΜΕΡΩΣΕΙΣ ΓΟΝΕΩΝ: 1η ενημέρωση(τηλεφωνική): 1ο δεκαήμερο Οκτωβρίου, 2η ενημέρωση γονέων : 29-30/11, 3η ενημέρωση γονέων: 7-8/3, 4η ενημέρωση γονέων : εξαρτάται από τη διεξαγωγή των διαγωνισμάτων προσομοίωσης",
    ],
  },
];
